01/note.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>note</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="note"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-08-08T13:51+0800"/>
<meta name="author" content="Young Lee"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">note</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
    <li><a href="#sec-1">1 $ 函数</a>
<</li>
  <li><a href="#sec-2">2 添加新类 addClass</a>div </li>
  <li><a href="#sec-3">3 执行代码</a>id="</li>
  <li><a href="#sec-4">4 匿名函数</a>outl</li>
  <li><a href="#sec-5">5 控制台显示</a>ine-c
<ul>
  <li><a href="#sec-5-1">5.1 console.log</a></li>
</ul>
</li>
</ul>
</div>
</div>
ontainer-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> $ 函数 &nbsp;&nbsp;&nbsp;<span class="tag"><span class="__">方法</span></span></h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>选择文档中的某一部分，这是通过 $() 函数来完成的
</li>
<li>该函数需要一个字符串参数，参数中可以包含任何CSS选择符表达式
</li>
<li>该函数会返回一个新的 jQuery 对象实例
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 添加新类 addClass &nbsp;&nbsp;&nbsp;<span class="tag"><span class="__">方法</span></span></h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>它会将一个CSS类应用到我们选择的页面元素，这个方法唯一的参数就是要添加的类名
</li>
<li>反方法是 removeClass()
</li>
<li>使用了隐式迭代机制，因此一次函数调用就可以完成对所有选择的文档部分的修改



<pre class="example">
function addHighlightClass() {
  $('div.poem-stanza').addClass('highlight');
}

$(document).ready(addHighlightClass);  

</pre>

</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 执行代码</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li>通过使用 $(document).ready() 方法，jQuery 支持我们预定在 DOM 加载完毕后调用某个函数，而不必等待页面中的图像加载
</li>
</ul>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 匿名函数</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li>以上实例的匿名函数写法
</li>
<li>实质跟 lambda 表达式是相似的



<pre class="example">
$(document).ready(function () {
  $('div.poem-stanza').addClass('highlight');
})

</pre>

</li>
</ul>

</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> 控制台显示</h2>
<div class="outline-text-2" id="text-5">


</div>

<div id="outline-container-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> console.log &nbsp;&nbsp;&nbsp;<span class="tag"><span class="__">方法</span></span></h3>
<div class="outline-text-3" id="text-5-1">

<ul>
<li>示例：在console中加入招聘信息



<pre class="example">
function addHighlightClass() {
  console.log('Maverick是一个小而精的团队，我们随时处于缺一个人的状态。');
  console.log('想来 Maverick 工作吗？简历请发送至: job@maverick.com');
  $('div.poem-stanza').addClass('highlight');
}

$(document).ready(addHighlightClass);

</pre>

</li>
</ul>

</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-08-08T13:51+0800</p>
<p class="author">Author: Young Lee</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3f with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
